Depot/app/controllers/products_controller.rb

SELECT * FROM `products`
---
  def index
    @products = Product.all

SELECT * FROM `products` WHERE (`products`.`id` = 2)
---
  def show
    @product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 2)
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO `products` (`price`, `created_at`, `title`, `image_url`, `updated_at`, `description`) VALUES(10.0, '2009-10-20 08:01:38', 'gaga', '/image/gaga.jpg', '2009-10-20 08:01:38', 'What shall I do?\r\nWhere shall my blood share?')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 2)
UPDATE `products` SET `updated_at` = '2009-10-21 03:02:24', `description` = 'sssssssssssssssssssssssssss\r\n\r\nwhat ?Over my head!' WHERE `id` = 4
---
  def update
    @product = Product.find(params[:id])
    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT * FROM `products` WHERE (`products`.`id` = 4)
DELETE FROM `products` WHERE `id` = 4
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy