Depot/app/controllers/store_controller.rb

SELECT * FROM `products` ORDER BY title
---
  def index
    @products = Product.find_products_for_sale

SELECT * FROM `products` WHERE (`products`.`id` = 2)
---
  def add_to_cart
    begin
      product = Product.find(params[:id])

INSERT INTO `line_items` (`created_at`, `product_id`, `quantity`, `order_id`, `total_price`, `updated_at`) VALUES('2009-10-20 08:19:13', 2, 1, 1, 10.0, '2009-10-20 08:19:13')
INSERT INTO `orders` (`name`, `address`, `created_at`, `updated_at`, `pay_type`, `email`) VALUES('hehe', 'hanchan', '2009-10-20 08:19:13', '2009-10-20 08:19:13', 'cc', 'jingtian2gmail.com')
---
  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save