Depot/app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`) VALUES('jingtian', '-6171457280.0723663980829637', '2009-10-20 08:09:35', '2009-10-20 08:09:35', '19ae6149fe53840acc2635e50eb44f941df313c7')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `updated_at` = '2009-10-21 05:49:54', `salt` = 'sss', `hashed_password` = 'sss' WHERE `id` = 7
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
DELETE FROM `users` WHERE `id` = 3
---
  def destroy
    @user = User.find(params[:id])
    begin
      if @user.eql?(User.find(session[:user_id]))      #you can't delete yourself!
        flash[:notice] = "You can't delete youself."
      else
        @user.destroy

SELECT * FROM `users` WHERE (`users`.`id` = 10) LIMIT 1
---
  def save_role
    @user = User.find(params[:id])